{
  "menu": {
    "home": "Home",
    "about": "About",
    "academic-education": "Academics",
    "testimonials": "Testimonials",
    "experiences": "Experiences",
    "skills": "Skills",
    "portfolio": "Projects",
    "contact": "Contact"
  },

  "home": {
    "title": "Better with each",
    "function1": "Computer Scientist",
    "function2": "Frontend Specialist",
    "function3": "Software Engineer",
    "function4": "UI/UX Designer",
    "resume": "Resume",
    "download": "Download",
    "close": "Close"
  },

  "name": {
    "br": "Brazil | PT",
    "us": "United States | EN",
    "fr": "France | FR",
    "it": "Italy | IT",
    "es": "Spain | ES"
  },

  "about": {
    "title": " Who is ",
    "text": "- Passionate Web Developer and dedicated, I have accumulated solid experience over 10 years, complemented by interpersonal skills that I consider fundamental to the world of programming. I specialized in web technologies, having comprehensive knowledge that extends across several tools and languages. My passion for constant learning and my commitment to evolving continually push me to apply my vast experience in development of innovative and impactful web solutions. My communicative nature makes me always ready to play a vital role in innovative proposals. Let's build something amazing together!"
  },

  "education": {
    "title": " My",
    "text": " Academics",
    "cards": [
      {
        "text": "Digital Innovation - Banco Pan Bootcamp (Frontend Development with Angular)"
      },
      {
        "text": "Harvard University - Master's degree within the Computer Science postgraduate program"
      },
      {
        "text": "Single College of MG - Postgraduate course in Software Engineering"
      },
      {
        "text": "Estácio de Sá College - Business Management"
      },
      {
        "text": "Digital Innovation - Working with Components in React"
      },
      {
        "text": "Digital Innovation - Component Architecture and complexity management in front-end"
      },
      {
        "text": "Digital Innovation - Essential Programming Logic"
      },
      {
        "text": "Digital Innovation - Essential Javascript ES6"
      },
      {
        "text": "Digital Innovation - Advanced Techniques in Angular 8"
      },
      {
        "text": "Adobe Professional - AEM (Front-end Developer)"
      },
      {
        "text": "Adobe Professional - AEM (Sites Business Practitioner)"
      },
      {
        "text": "VueJs Brasil - Vuejs Course (Basic to Advanced)"
      },
      {
        "text": "Digital Innovation - Vue.js Directives and Component Properties"
      },
      {
        "text": "Digital Innovation - Components, Methods, and Lifecycle with Vue.js"
      },
      {
        "text": "Udemy - Javascript and Typescript Course from Basic to Advanced"
      },
      {
        "text": "Sebrae - Business Financial Education Course"
      },
      {
        "text": "Sebrae - Financial Management Course"
      },
      {
        "text": "Sebrae - Customer Success Course (How to Acquire and Retain Customers)"
      },
      {
        "text": "Sebrae - Digital Marketing Course for Entrepreneurs"
      },
      {
        "text": "Sebrae - Financial Strategy for Growth Course"
      },
      {
        "text": "Sebrae - Strategic Planning for Entrepreneurs Course"
      },
      {
        "text": "FGV - Digital Security Course"
      },
      {
        "text": "Cursos 24h - Administrative Assistant"
      }
    ]
  },

  "testimonials": {
    "title": "Some",
    "text": " Testimonials",
    "subtitle1": "I had the pleasure of working with Hudson Kennedy at DT3 (Bender M), where he demonstrated exceptional skills and exemplary dedication. His ability to solve problems analytically and creatively, combined with his excellent communication skills, made him a valuable member of the team. Hudson always anticipated the team's needs, proposing improvements and innovative solutions that resulted in significant success in our Sprints. I highly recommend him for any future position, as I know he will continue to achieve great success in his career.",
    "subtitle2": "Excellent work partner and a great person! His sense of responsibility stands out among others, never leaving anything behind or without a solution. I learned a lot from Hudson and will carry these lessons with me for life.",
    "subtitle3": "Hudson is an excellent work partner, always seeking improvement and developing new skills. He is always willing to help. Dedicated and committed.",
    "subtitle4": "Exemplary professional! Very dedicated, resolute, and proactive. And with excellent interpersonal skills. Highly recommended!",
    "subtitle5": "Great professional, always seeking to learn, improve, and master new subjects. Helping the team solve problems.",
    "subtitle6": "For me, Hudson was an excellent instructor. He taught me to handle a platform that is not at all in my field. Exemplary professional and of great capacity. He has everything to take off in his career as a Developer.",
    "subtitle7": "I worked with Hudson at Vilt. Even though it was a short period, I had the opportunity to get to know this wonderful person, very animated and collaborative. We participated in training and some challenges together, during this time, as a more experienced person, he showed himself to be a good guide and an excellent motivator for everyone around him and especially for the younger people. Always willing to help, he will be a great ally in any team.",
    "subtitle8": "I had the opportunity to work with Hudson. It was a very interesting experience, as he is a very dedicated and competent professional in the frontend. A pleasant surprise and highly recommended. Success Hudson!",
    "subtitle9": "Hudson is a complete professional, always proactive and willing to help, but during the time we worked together, he really stood out for his skill in frontend development and knowledge of UX/UI, always very detail-oriented. He became a reference for me, I am sure he will contribute a lot to the team he joins!",
    "subtitle10": "Working with Hudson was an excellent experience. His understanding of FrontEnd is evident in every implementation and support to the team. He is proactive, creative, and always seeks innovative and elegant solutions.",
    "subtitle11": "I had the pleasure of having Hudson on my team. A focused and creative developer, always seeking solutions to the challenges we encounter in the project. Proactive and available to help teammates, aiming for the best in delivering objectives!",
    "subtitle12": "A great professional and a deep connoisseur of the front-end, not limited to using frameworks to make the 'magic' happen. Highly recommended!",
    "subtitle13": "I had the pleasure of working with colleague Hudson Kennedy in the development team at Cast, on the MG-Florestas project, and I can attest to his exceptional skills and dedication. Hudson is a talented and passionate front-end developer, always demonstrating a deep understanding of the latest technologies and best practices. During our time together at Cast, he played a fundamental role in the success of the project. What impressed me most about Hudson is his ability to tackle complex challenges with creativity and efficiency. His attention to detail and commitment to delivering high-quality products always set him apart. In addition to his impressive technical skills, Hudson was an incredible team member. His clear communication and willingness to collaborate made the work environment more productive and enjoyable. I recommend Hudson without reservation and am confident that he will continue to have a positive impact wherever he goes. If you are looking for a talented and committed front-end developer, Hudson Kennedy is the right choice. Feel free to contact me if you need additional information. Sincerely, Gei Batista.",
    "subtitle14": "Hudson was one of the candidates I had the pleasure of meeting. A very educated person, with an incredible life story and led our conversation in a very relaxed manner, always explaining with great richness of detail his experiences. An excellent profile to be evaluated.",
    "subtitle15": "Hudson is a perfect professional, committed to what he does, always completing his projects with excellence.",
    "subtitle16": "Hudson is a super dedicated professional and committed to delivery, always demonstrating proactivity, ease, as well as initiative and the ability to solve problems objectively and with technical knowledge."
  },

  "experiences": {
    "title": " My",
    "text": " Experiences",
    "subtitle1": "Freelancer/Personal Projects",
    "subtitle2": "E-commerce Analyst / Front-end Developer",
    "subtitle3": "Fullstack Technical Consultant",
    "subtitle4": "Frontend Engineer",
    "subtitle5": "Fullstack Developer",
    "subtitle6": "Senior Front-End Developer",
    "description1": "I took an industrial computing course at ETERJ and worked on freelance projects, using Angular Js, VB.net, HTML, Javascript, Jquery, Bootstrap, Sass.",
    "description2": "Issuance of invoices, migration of the website from Wordpress to React with NodeJs, using redux, router proptypes, emailjs/browser, swiper, sweetalert, etc... optimization and loading of images and responsible for the integration of ERP Bling and integration of marketplaces",
    "description3": "Fullstack consultancy, using Java/NodeJs on the Backend, Angular/React on the Frontend, as well as Adobe Experience Manager(AEM) programs, with services for Porto, CVC, etc.",
    "description4": "Freelance work, where I worked on creating architecture and optimizing pages and image loading, using Vue3 on the Frontend, PHP and Laravel on the Backend, as well as Docker and Webpack to set up application containers, layouts and styles with Sass/Scss, etc...",
    "description5": "Acting directly on code maintenance/refactoring directives and treatments, using Java/springboot, NodeJs/Express on the Backend, PostgreSQL,Typescript with Angular/React on the Frontend",
    "description6": "Freelance work, where I worked on project architecture, updating Angular version 14 to version 15, dependency adjustments, syntax corrections, layouts and styles with Sass/Scss, etc...",
    "description7": "Freelance work, Creation and maintenance of layouts and interfaces using React, Styled-Components, and Tailwind CSS, creation of unit tests with Cypress and Jest, optimization of pages and components.",
    "date1": "February 2012 - Present",
    "date2": "February 2019 - June 2021",
    "date3": "January 2022 - April 2022",
    "date4": "April 2022 - August 2022",
    "date5": "August 2022 - October 2023",
    "date6": "November 2023 - January 2024",
    "date7": "April 2024 - Present"
  },

  "skills": {
    "title": " My",
    "text": " Skills",
    "search": "Search...",
    "noResults": "No skills found",
    "cloudWord": "Word Cloud",
    "searchable": "Search and Filter"
  },

  "projects": {
    "title": " Main",
    "text": " Projects",
    "subtitle": "Used Technologies",
    "data": [
      {
        "description": "Simple website, following object-oriented Course guidance on Udemy."
      },
      {
        "description": "Pokedex using API to query and list Pokémon."
      },
      {
        "description": "Game created in React and Typescript, to practice and exercise a little more in the language."
      },
      {
        "description": "A historical homage and a precise recreation of the original Pac-Man arcade game."
      },
      {
        "description": "App created with HTML, CSS, and JavaScript, consuming the WeatherAPI, to display information for each city."
      },
      {
        "description": "Analog clock and digital clock, made with TypeScript and Styled-Components"
      },
      {
        "description": "A credit card form, built with vuejs and fully responsive."
      },
      {
        "description": "Swiss Canton Holiday Tracker"
      },
      {
        "description": "Animated login screen, made for practice"
      },
      {
        "description": "Global Currency Converter, made in Udemy course"
      },
      {
        "description": "A small web app to speed up the draw of teams in football"
      },
      {
        "description": "Website of a task organizer (to-do list)"
      },
      {
        "description": "Simple BMI calculator for body mass calculation"
      },
      {
        "description": "Simple Landing Page, created through a technical test"
      },
      {
        "description": "A project to search for your favorite Pokémon and learn about the history of these little creatures' world"
      },
      {
        "description": ""
      },
      {
        "description": ""
      }
    ]
  },

  "contact": {
    "title": "Contact",
    "text": "Me!",
    "name": "Full Name *",
    "email": "Email *",
    "phone": "Phone *",
    "subject": "Subject *",
    "message": "Your Message *",
    "submit": "Send Message *",
    "error": "Required field"
  }
}
