{
  "menu": {
    "home": "Inicio",
    "about": "Sobre Mí",
    "academic-education": "Académica",
    "testimonials": "Deposiciones",
    "experiences": "Experiencias",
    "skills": "Habilidades",
    "portfolio": "Proyectos",
    "contact": "Contacto"
  },

  "home": {
    "loading": "Cargando...",
    "resume": "Currículum",
    "resumeSubtitle": "Ver o descargar archivo PDF",
    "download": "Descargar",
    "close": "Cerrar",
    "roles": [
      "Arquitecto de Soluciones",
      "Ingeniero de Software",
      "Especialista en Frontend",
      "Desarrollador Fullstack",
      "Diseñador UI/UX"
    ]
  },

  "name": {
    "br": "Brasil | PT",
    "us": "Estados Unidos | EN",
    "fr": "Francia | FR",
    "it": "Italia | IT",
    "es": "España | ES"
  },

  "navbar": {
    "effect": "Efecto de Partículas",
    "sound": "Efecto Sonoro",
    "theme": "Tema",
    "language": "Idiomas"
  },

  "about": {
    "title": " Quién Soy ",
    "text": "- Soy un Ingeniero de Software con más de 10 años de experiencia en el desarrollo de aplicaciones web modernas, escalables y orientadas al producto. Actúo como Desarrollador Fullstack con fuerte especialización en Frontend, participando desde la definición de la arquitectura hasta la entrega de interfaces performantes, bien estructuradas y enfocadas en la experiencia del usuario. A lo largo de mi trayectoria, he construido una base sólida en ingeniería de software, arquitectura de soluciones y mejores prácticas de desarrollo, siempre buscando equilibrar calidad técnica, usabilidad e impacto para el negocio. Tengo facilidad para colaborar con equipos multidisciplinarios, transformando requisitos complejos en soluciones claras, eficientes y sustentables. Estoy motivado por el aprendizaje continuo, la evolución técnica y el desafío de crear productos que generen valor real.",
    "showMore": "Ver más",
    "showLess": "Ver menos"
  },

  "education": {
    "title": " Mi",
    "text": " Educación Académica",
    "clickToView": "ver certificado",
    "cardTitles": {
      "card1": "Maestría en Ciencias de la Computación",
      "card2": "Especialización en Ingeniería de Software",
      "card3": "Licenciatura en Procesos Gerenciales",
      "card4": "Bootcamp Desarrollo Frontend con Angular",
      "card5": "Desarrollador Frontend AEM",
      "card6": "Especialista en Negocios AEM Sites",
      "card7": "Vue.js de Básico a Avanzado",
      "card8": "JavaScript y TypeScript de Básico a Avanzado",
      "card9": "Trabajando con Componentes React",
      "card10": "Arquitectura de Componentes Frontend",
      "card11": "Lógica de Programación Esencial",
      "card12": "JavaScript ES6 Esencial",
      "card13": "Técnicas Avanzadas en Angular 8",
      "card14": "Pruebas Automatizadas con Cypress",
      "card15": "Directivas y Propiedades de Componentes Vue.js",
      "card16": "Componentes, Métodos y Ciclo de Vida con Vue.js",
      "card17": "Seguridad Digital",
      "card18": "Gestión Financiera",
      "card19": "Éxito del Cliente",
      "card20": "Marketing Digital para Emprendedores",
      "card21": "Estrategia Financiera para el Crecimiento",
      "card22": "Planificación Estratégica",
      "card23": "Educación Financiera Empresarial",
      "card24": "Asistente Administrativo"
    },
    "cardInstitutions": {
      "card1": "Universidad de Harvard",
      "card2": "Faculdade Única de MG",
      "card3": "Universidad Estácio de Sá",
      "card4": "Digital Innovation One · Banco Pan",
      "card5": "Adobe Professional",
      "card6": "Adobe Professional",
      "card7": "VueJS Brasil",
      "card8": "Udemy",
      "card9": "Digital Innovation One",
      "card10": "Digital Innovation One",
      "card11": "Digital Innovation One",
      "card12": "Digital Innovation One",
      "card13": "Digital Innovation One",
      "card14": "Digital Innovation One",
      "card15": "Digital Innovation One",
      "card16": "Digital Innovation One",
      "card17": "Fundación Getúlio Vargas",
      "card18": "Sebrae",
      "card19": "Sebrae",
      "card20": "Sebrae",
      "card21": "Sebrae",
      "card22": "Sebrae",
      "card23": "Sebrae",
      "card24": "Cursos 24h"
    },
    "cardDescriptions": {
      "card1": "Programa de posgrado enfocado en Ciencias de la Computación, Ingeniería de Software y Arquitectura de Soluciones.",
      "card2": "Especialización en ingeniería de software, mejores prácticas, arquitectura de sistemas y calidad de código.",
      "card3": "Formación enfocada en gestión, procesos organizacionales y visión estratégica de negocios.",
      "card4": "Bootcamp práctico enfocado en Angular, arquitectura frontend y aplicaciones corporativas.",
      "card5": "Desarrollo frontend utilizando Adobe Experience Manager.",
      "card6": "Fundamentos y prácticas de negocio con Adobe Experience Manager Sites.",
      "card7": "Curso completo sobre fundamentos, componentes, ciclo de vida y arquitectura Vue.js.",
      "card8": "Curso completo que abarca JavaScript moderno y TypeScript.",
      "card9": "Creación y reutilización de componentes React.",
      "card10": "Arquitectura de componentes y gestión de la complejidad en frontend.",
      "card11": "Fundamentos de la lógica de programación.",
      "card12": "Características modernas de JavaScript ES6.",
      "card13": "Angular avanzado y mejores prácticas.",
      "card14": "Automatización de pruebas end-to-end con Cypress.",
      "card15": "Directivas y propiedades de componentes Vue.js.",
      "card16": "Componentes, métodos y ciclo de vida con Vue.js.",
      "card17": "Fundamentos de seguridad de la información.",
      "card18": "Gestión financiera aplicada a negocios.",
      "card19": "Estrategias para conquistar y mantener clientes.",
      "card20": "Fundamentos del marketing digital.",
      "card21": "Planificación financiera estratégica.",
      "card22": "Planificación estratégica para negocios.",
      "card23": "Educación financiera aplicada a empresas.",
      "card24": "Formación en asistencia administrativa y gestión."
    }
  },

  "testimonials": {
    "title": " Algunos",
    "text": " Testimonios",
    "clickToFlip": "Haz clic para voltear",
    "subtitle1": "Tuve el placer de trabajar con Hudson Kennedy en DT3 (Bender M), donde demostró habilidades excepcionales y una dedicación ejemplar. Su capacidad para resolver problemas de manera analítica y creativa, combinada con sus excelentes habilidades de comunicación, lo convirtió en un miembro valioso del equipo. Hudson siempre anticipó las necesidades del equipo, proponiendo mejoras y soluciones innovadoras que resultaron en un éxito significativo en nuestras Sprints. Lo recomiendo encarecidamente para cualquier posición futura, ya que sé que continuará logrando grandes éxitos en su carrera.",
    "subtitle2": "Excelente compañero de trabajo y una gran persona! Su sentido de la responsabilidad destaca entre los demás, nunca dejando nada atrás o sin solución. Aprendí mucho de Hudson y llevaré estos aprendizajes conmigo para toda la vida.",
    "subtitle3": "Hudson es un excelente compañero de trabajo, siempre buscando mejorar y desarrollar nuevas habilidades. Siempre está dispuesto a ayudar. Dedicado y comprometido.",
    "subtitle4": "Hudson es un profesional super dedicado y comprometido con la entrega, siempre demostrando proactividad, facilidad, así como iniciativa y capacidad para resolver problemas de manera objetiva y con conocimientos técnicos.",
    "subtitle5": "Gran profesional, siempre buscando aprender, mejorar y dominar nuevos temas. Ayudando al equipo a resolver problemas.",
    "subtitle6": "Para mí, Hudson fue un excelente instructor. Me enseñó a manejar una plataforma que no está en absoluto en mi campo. Profesional ejemplar y de gran capacidad. Tiene todo para despegar en su carrera como Desarrollador.",
    "subtitle7": "Trabajé con Hudson en Vilt. Aunque fue un período corto, tuve la oportunidad de conocer a esta persona maravillosa, muy animada y colaborativa. Participamos en capacitaciones y algunos desafíos juntos, durante este tiempo, como una persona más experimentada, se mostró un buen guía y un excelente motivador para todos a su alrededor y especialmente para las personas más jóvenes. Siempre dispuesto a ayudar, será un gran aliado en cualquier equipo.",
    "subtitle8": "Tuve la oportunidad de trabajar con Hudson. Fue una experiencia muy interesante, ya que es un profesional muy dedicado y competente en el frontend. Una grata sorpresa y super recomendado. ¡Éxito Hudson!",
    "subtitle9": "Hudson es un profesional completo, siempre proactivo y dispuesto a ayudar, pero durante el tiempo que trabajamos juntos, realmente se destacó por su habilidad en el desarrollo frontend y conocimientos de UX/UI, siempre muy atento a los detalles. Se convirtió en una referencia para mí, estoy seguro de que contribuirá mucho al equipo del que forme parte!",
    "subtitle10": "Trabajar con Hudson fue una experiencia excelente. Su comprensión del FrontEnd es evidente en cada implementación y apoyo al equipo. Es proactivo, creativo y siempre busca soluciones innovadoras y elegantes.",
    "subtitle11": "Tuve el placer de tener a Hudson en mi equipo. Un desarrollador enfocado y creativo, siempre buscando soluciones a los desafíos que encontramos en el proyecto. Proactivo y disponible para ayudar a los compañeros de equipo, buscando lo mejor para la entrega de los objetivos!",
    "subtitle12": "Un gran profesional y un profundo conocedor del front-end, no limitándose al uso de frameworks para hacer la 'magia'. ¡Super recomendado!",
    "subtitle13": "Tuve el placer de trabajar con el colega Hudson Kennedy en el equipo de desarrollo de Cast, en el proyecto MG-Florestas, y puedo atestiguar sus habilidades excepcionales y dedicación. Hudson es un desarrollador front-end talentoso y apasionado, siempre demostrando una profunda comprensión de las tecnologías más recientes y mejores prácticas. Durante nuestro tiempo juntos en Cast, desempeñó un papel fundamental en el éxito del proyecto. Lo que más me impresionó de Hudson es su capacidad para enfrentar desafíos complejos con creatividad y eficiencia. Su atención a los detalles y compromiso con la entrega de productos de alta calidad siempre lo destacaron. Además de sus impresionantes habilidades técnicas, Hudson fue un miembro increíble del equipo. Su comunicación clara y disposición para colaborar hicieron que el ambiente de trabajo fuera más productivo y agradable. Recomiendo a Hudson sin reservas y estoy seguro de que continuará teniendo un impacto positivo dondequiera que vaya. Si estás buscando un desarrollador front-end talentoso y comprometido, Hudson Kennedy es la elección correcta. No dudes en contactarme si necesitas información adicional. Atentamente, Gei Batista.",
    "subtitle14": "Hudson fue uno de los candidatos que tuve el placer de conocer. Una persona muy educada, con una historia de vida increíble y llevó nuestra conversación de una manera muy relajada, siempre explicando con gran riqueza de detalles sus experiencias. Un excelente perfil para evaluar.",
    "subtitle15": "Hudson es un profesional perfecto, comprometido con lo que hace, siempre completando sus proyectos con excelencia.",
    "subtitle16": "Profesional ejemplar! Muy dedicado, resolutivo y proactivo. Y con excelentes habilidades interpersonales. ¡Super recomendado!",
    "subtitle17": "Trabajar con Hudson siempre es una experiencia increíble. Es el tipo de profesional que no solo entrega resultados, sino que también transforma el entorno a su alrededor. Su responsabilidad y compromiso son admirables, y siempre enfrenta los desafíos con creatividad y una perspectiva innovadora, buscando siempre la mejor solución para cada problema. Pero lo que realmente diferencia a Hudson no es solo su competencia técnica, sino la forma en que se conecta con las personas. Su buen humor hace que cualquier día sea más ligero, y su disposición genuina para ayudar hace que todos a su alrededor se sientan apoyados. Realmente se preocupa por el bienestar del equipo, creando lazos que van más allá del entorno profesional. Si estás buscando un desarrollador talentoso, creativo y que realmente marque la diferencia en un equipo, Hudson es sin duda la persona adecuada. ¡Cualquier empresa tendría suerte de tenerlo!",
    "subtitle18": "Tengo la satisfacción de decir que ya he trabajado con Hudson en el mismo proyecto. Él contribuye de forma significativa a un ambiente de trabajo saludable y ligero. Desde el punto de vista técnico, siempre busca ir más allá de lo básico, lo que enriquece mucho el trabajo de todo el equipo."
  },

  "experiences": {
    "title": " Mis",
    "text": " Experiencias",
    "subtitle1": "Freelancer/Proyectos Personales",
    "subtitle2": "Analista de E-commerce / Desarrollador Front-end",
    "subtitle3": "Consultor Técnico Fullstack",
    "subtitle4": "Ingeniero Frontend",
    "subtitle5": "Desarrollador Fullstack",
    "subtitle6": "Desarrollador Front-End",
    "description1": "Hice un curso de informática industrial en ETERJ y trabajos como freelancer utilizando AngularJs, VB.net, HTML, Javascript, Jquery, Bootstrap, Sass.",
    "description2": "Emisión de facturas, migración de sitio web en WordPress a React con NodeJs usando Redux, Router, PropTypes, emailjs/browser, Swiper, SweetAlert, etc... optimización y carga de imágenes y responsable de la integración del ERP Bling y de los marketplaces.",
    "description3": "Consultoría Fullstack utilizando Java/NodeJs en el backend, Angular/React en el frontend y Adobe Experience Manager (AEM) en servicios para Porto, CVC, entre otros.",
    "description4": "Trabajo como profesional independiente, en la creación de arquitectura y optimización de páginas y carga de imágenes utilizando Vue3 en el frontend, PHP y Laravel en el backend, además de Docker y Webpack para montar contenedores de la aplicación, layouts y estilos con Sass/Scss, etc...",
    "description5": "Participación directa en directivas y mantenimiento/refactorización de código utilizando Java/Spring Boot, NodeJs/Express en el backend, PostgreSQL y Typescript con Angular/React en el frontend.",
    "description6": "Trabajo como profesional independiente, en la arquitectura del proyecto, actualizando Angular de la versión 14 a la 15, ajustes de dependencias, corrección de errores de sintaxis, layouts y estilos con Sass/Scss, etc...",
    "description7": "Trabajo como profesional independiente, utilizando NestJs y protocolo gRPC en el backend con Prisma para modelado de base de datos en PostgreSQL, VueJs con Quasar en el frontend, Typescript, pruebas con Cypress, refactorización y creación de componentes y API.",
    "description8": "Trabajo como profesional independiente, creación y mantenimiento de layouts e interfaces con React, Styled-Components y Tailwind CSS, pruebas unitarias con Cypress y Jest, optimización de páginas y componentes.",
    "description9": "Creación del sitio con Shopify, jQuery para respuestas externas y tratamientos de integración como la oficina de correos, la pasarela de pago, el bling ERP y etc.",
    "date1": "Febrero 2012 - Diciembre 2016",
    "date2": "Febrero 2019 - Junio 2021",
    "date3": "Julio 2021 - Agosto 2021",
    "date4": "Enero 2022 - Abril 2022",
    "date5": "Abril 2022 - Agosto 2022",
    "date6": "Agosto 2022 - Octubre 2023",
    "date7": "Noviembre 2023 - Enero 2024",
    "date8": "Abril 2024 - Mayo 2025",
    "date9": "Octubre 2024 - hasta el presente"
  },

  "skills": {
    "title": " Mis",
    "text": " Habilidades",
    "search": "Buscar...",
    "noResults": "No se encontraron habilidades",
    "cloudWord": "Nube de palabras",
    "searchable": "Filtrado y búsqueda",
    "chart": "Panel",
    "expert": "Especialista",
    "advanced": "Avanzado",
    "intermediate": "Intermedio",
    "basic": "Básico",
    "dashboardTitle": "Panel de Habilidades",
    "dashboardSubtitle": "{{count}} habilidades de competencia",
    "proficiency": "Competencia",
    "category": "Categoría",
    "pieView": "Distribución de Principales Habilidades",
    "rankingView": "Ranking Completo de Habilidades",
    "mySkills": "Mis Habilidades",
    "proficiencyLevel": "Competencia",
    "averageLevel": "Nivel Promedio",
    "totalSkills": "Total de Habilidades",
    "clickToViewDetails": "Haga clic para ver detalles",
    "skillsLabel": "habilidades"
  },

  "projects": {
    "title": " Principales",
    "text": " Proyectos",
    "subtitle": "Tecnologías Utilizadas",
    "clickToFlip": "Haz clic para voltear",
    "inDevelopment": "En desarrollo",
    "data": [
      {
        "description": "Sitio web simple, siguiendo la orientación del curso orientado a objetos en Udemy."
      },
      {
        "description": "Pokedex usa API para consultar y enumerar Pokémon."
      },
      {
        "description": "Juego creado en React y TypeScript, para practicar y ejercitar un poco más en el lenguaje."
      },
      {
        "description": "Un homenaje histórico y una recreación precisa del juego original de arcade Pac-Man."
      },
      {
        "description": "Aplicación creada con HTML, CSS y JavaScript, consumiendo la WeatherAPI, para mostrar información de cada ciudad."
      },
      {
        "description": "Reloj analógico y reloj digital, hecho con TypeScript y Styled-Components"
      },
      {
        "description": "Un formulario de tarjeta de crédito, construido con vuejs y totalmente receptivo."
      },
      {
        "description": "Rastreador de días festivos del Cantón Suizo"
      },
      {
        "description": "Pantalla de inicio de sesión animada, hecha para practicar"
      },
      {
        "description": "Convertidor de moneda global, realizado en el curso de Udemy"
      },
      {
        "description": "Una pequeña aplicación web para agilizar el sorteo de equipos en el fútbol"
      },
      {
        "description": "Sitio web de un organizador de tareas (lista de tareas pendientes)"
      },
      {
        "description": "Calculadora de IMC simple para el cálculo de la masa corporal"
      },
      {
        "description": "Página de aterrizaje simple, creada a través de una prueba técnica"
      },
      {
        "description": "Proyecto para buscar tus Pokémon favoritos y conocer la historia del mundo de estas pequeñas criaturas"
      },
      {
        "description": " Sistema de encuestas en tiempo real"
      },
      {
        "description": "Una aplicación de noticias en tiempo real utilizando NewsAPI."
      },
      {
        "description": "Una aplicación de finanzas personales para gestionar gastos e ingresos."
      },
      {
        "description": "Un sitio para una barbería, con reserva en línea."
      }
    ]
  },

  "contact": {
    "title": " Habla",
    "text": " Conmigo",
    "locationTitle": "Mi Ubicación",
    "formTitle": "Enviar un Mensaje",
    "nameLabel": "Nombre",
    "namePlaceholder": "Tu nombre completo",
    "emailLabel": "Correo",
    "emailPlaceholder": "tu@email.com",
    "subjectLabel": "Asunto",
    "subjectPlaceholder": "¿De qué se trata?",
    "messageLabel": "Mensaje",
    "messagePlaceholder": "Cuéntame sobre tu proyecto o cómo puedo ayudarte...",
    "sendButton": "Enviar Mensaje",
    "location": {
      "view": "Ver ubicación"
    }
  },

  "footer": {
    "title": "Contacto"
  },

  "tour": {
    "next": "Siguiente",
    "previous": "Anterior",
    "done": "Finalizar",
    "close": "Cerrar tour",
    "progress": "{{current}} de {{total}}",
    "start": "Tour",
    "navbar": {
      "title": "Navegación Principal",
      "description": "Usa este menú para navegar entre las diferentes secciones de mi portafolio. Cada sección muestra aspectos diferentes de mi carrera."
    },
    "theme": {
      "title": "Alternar Tema",
      "description": "Cambia entre temas claro y oscuro para una experiencia visual personalizada."
    },
    "language": {
      "title": "Selector de Idioma",
      "description": "Elige tu idioma preferido. El portafolio está disponible en 5 idiomas diferentes."
    },
    "sound": {
      "title": "Control de Audio",
      "description": "Activa o desactiva los efectos de sonido mientras navegas por el portafolio."
    },
    "particles": {
      "title": "Efectos de Partículas",
      "description": "Activa o desactiva los efectos de partículas animadas en el fondo para mejorar la experiencia visual."
    },
    "hero": {
      "title": "Sección Principal",
      "description": "Esta es mi presentación inicial. Aquí encontrarás mi nombre y una breve descripción de lo que hago."
    },
    "typewriter": {
      "title": "Animación de Texto",
      "description": "Este texto animado muestra mis diferentes áreas de especialización en desarrollo."
    },
    "resume": {
      "title": "Botón del CV",
      "description": "Haz clic aquí para ver o descargar mi currículum completo en formato PDF."
    },
    "about": {
      "title": "Sobre Mí",
      "description": "En esta sección conocerás mi historia, experiencia y pasión por el desarrollo."
    },
    "skillsSearch": {
      "title": "Búsqueda de Habilidades",
      "description": "Usa esta barra de búsqueda para encontrar habilidades específicas en mi conjunto de competencias."
    },
    "skillsChart": {
      "title": "Gráfico de Habilidades",
      "description": "Este gráfico muestra mi nivel de competencia en diferentes tecnologías y herramientas."
    },
    "wordCloud": {
      "title": "Nube de Palabras",
      "description": "Una representación visual de mis principales tecnologías, donde el tamaño indica el nivel de experiencia."
    },
    "portfolioGrid": {
      "title": "Cuadrícula de Proyectos",
      "description": "Aquí están mis principales proyectos. Cada tarjeta muestra un proyecto diferente con sus tecnologías."
    },
    "portfolioCard": {
      "title": "Tarjeta del Proyecto",
      "description": "Haz clic en la tarjeta para voltearla y ver más detalles, tecnologías usadas y enlaces del proyecto."
    },
    "portfolioPagination": {
      "title": "Paginación",
      "description": "Usa estos botones para navegar entre diferentes páginas de proyectos."
    },
    "timeline": {
      "title": "Línea de Tiempo",
      "description": "Esta línea de tiempo muestra mi trayectoria profesional con todas las experiencias y posiciones que he ocupado."
    },
    "testimonials": {
      "title": "Testimonios",
      "description": "Aquí encontrarás comentarios de colegas y clientes sobre mi trabajo y desempeño profesional."
    },
    "education": {
      "title": "Formación Académica",
      "description": "Mi trayectoria educativa, incluyendo cursos, certificaciones y formaciones que contribuyeron a mi desarrollo."
    },
    "contactForm": {
      "title": "Formulario de Contacto",
      "description": "Utilice este formulario para ponerse en contacto conmigo. Todos los campos son obligatorios para garantizar que pueda responder adecuadamente."
    },
    "footer": {
      "title": "Redes Sociales",
      "description": "Contáctame a través de mis redes sociales y canales de comunicación."
    }
  }
}
