{
  "menu": {
    "home": "Pagina iniziale",
    "about": "Chi Sono",
    "academic-education": "Accademica",
    "testimonials": "Deposizioni",
    "experiences": "Esperienze",
    "skills": "Competenze",
    "portfolio": "Portfolio",
    "contact": "Contatti"
  },

  "home": {
    "title": "Migliore in ogni",
    "function1": "Scienziato informatico",
    "function2": "Specialista del frontend",
    "function3": "Ingegnere del software",
    "function4": "Progettista UI/UX",
    "resume": "Curriculum",
    "download": "Caricare",
    "close": "Chiudere"
  },

  "name": {
    "br": "Brasile | PT",
    "us": "Stati Uniti | EN",
    "fr": "Francia | FR",
    "it": "Italia | IT",
    "es": "Spagna | ES"
  },

  "about": {
    "title": " Chi è ",
    "text": "- Sviluppatore web appassionato e dedicato, ho accumulato una solida esperienza in 10 anni, completata da competenze interpersonali che considero fondamentali nell'universo della programmazione. Mi sono specializzato nelle tecnologie web, possedendo una conoscenza approfondita che si estende su diversi strumenti e linguaggi. La mia passione per l'apprendimento continuo e il mio impegno a evolvere costantemente mi spingono ad applicare la mia vasta esperienza nello sviluppo di soluzioni web innovative e impattanti. La mia natura comunicativa mi rende sempre pronto a svolgere un ruolo vitale in proposte innovative. Costruiamo qualcosa di incredibile insieme!"
  },

  "education": {
    "title": " La Mia",
    "text": " Educazione Accademica",
    "cards": [
      {
        "text": "Innovazione Digitale - Bootcamp Banco Pan (Sviluppo Frontend con Angular)"
      },
      {
        "text": "Università di Harvard - Master che opera all'interno del programma di post-laurea in Informatica"
      },
      {
        "text": "Collegio Unico di MG - Post-laurea in Ingegneria del Software"
      },
      {
        "text": "Estácio de Sá Collegio - Gestione dei Processi"
      },
      {
        "text": "Innovazione Digitale - Lavorare con Componenti in React"
      },
      {
        "text": "Innovazione Digitale - Architettura dei Componenti e gestione della complessità nel front-end"
      },
      {
        "text": "Innovazione Digitale - Logica di Programmazione Essenziale"
      },
      {
        "text": "Innovazione Digitale - Javascript ES6 Essenziale"
      },
      {
        "text": "Innovazione Digitale - Tecniche Avanzate in Angular 8"
      },
      {
        "text": "Professionista Adobe - AEM (Sviluppatore Front-end)"
      },
      {
        "text": "Professionista Adobe - AEM (Sites Business Practitioner)"
      },
      {
        "text": "VueJs Brasil - Corso Vuejs (Dal Base all'Avanzato)"
      },
      {
        "text": "Innovazione Digitale - Direttive e Proprietà dei Componenti Vue.js"
      },
      {
        "text": "Innovazione Digitale - Componenti, Metodi e Ciclo di vita con Vue.js"
      },
      {
        "text": "Udemy - Corso Javascript e Typescript dal Base all'Avanzato"
      },
      {
        "text": "Sebrae - Corso di Educazione Finanziaria Aziendale"
      },
      {
        "text": "Sebrae - Corso di Gestione Finanziaria"
      },
      {
        "text": "Sebrae - Corso Customer Success (Come Conquistare e Mantenere Clienti)"
      },
      {
        "text": "Sebrae - Corso di Marketing Digitale per Imprenditori"
      },
      {
        "text": "Sebrae - Corso di Strategia Finanziaria per la Crescita"
      },
      {
        "text": "Sebrae - Corso di Pianificazione Strategica per Imprenditori"
      },
      {
        "text": "FGV - Corso di Sicurezza Digitale"
      },
      {
        "text": "Corsi 24h - Assistente Amministrativo"
      }
    ]
  },

  "testimonials": {
    "title": " Alcune",
    "text": " Testimonianze",
    "subtitle1": "I had the pleasure of working with Hudson Kennedy at DT3 (Bender M), where he demonstrated exceptional skills and exemplary dedication. His ability to solve problems analytically and creatively, combined with his excellent communication skills, made him a valuable member of the team. Hudson always anticipated the team's needs, proposing improvements and innovative solutions that resulted in significant success in our Sprints. I highly recommend him for any future position, as I know he will continue to achieve great success in his career.",
    "subtitle2": "Excellent work partner and a great person! His sense of responsibility stands out among others, never leaving anything behind or without a solution. I learned a lot from Hudson and will carry these lessons with me for life.",
    "subtitle3": "Hudson is an excellent work partner, always seeking improvement and developing new skills. He is always willing to help. Dedicated and committed.",
    "subtitle4": "Exemplary professional! Very dedicated, resolute, and proactive. And with excellent interpersonal skills. Highly recommended!",
    "subtitle5": "Great professional, always seeking to learn, improve, and master new subjects. Helping the team solve problems.",
    "subtitle6": "For me, Hudson was an excellent instructor. He taught me to handle a platform that is not at all in my field. Exemplary professional and of great capacity. He has everything to take off in his career as a Developer.",
    "subtitle7": "I worked with Hudson at Vilt. Even though it was a short period, I had the opportunity to get to know this wonderful person, very animated and collaborative. We participated in training and some challenges together, during this time, as a more experienced person, he showed himself to be a good guide and an excellent motivator for everyone around him and especially for the younger people. Always willing to help, he will be a great ally in any team.",
    "subtitle8": "I had the opportunity to work with Hudson. It was a very interesting experience, as he is a very dedicated and competent professional in the frontend. A pleasant surprise and highly recommended. Success Hudson!",
    "subtitle9": "Hudson is a complete professional, always proactive and willing to help, but during the time we worked together, he really stood out for his skill in frontend development and knowledge of UX/UI, always very detail-oriented. He became a reference for me, I am sure he will contribute a lot to the team he joins!",
    "subtitle10": "Working with Hudson was an excellent experience. His understanding of FrontEnd is evident in every implementation and support to the team. He is proactive, creative, and always seeks innovative and elegant solutions.",
    "subtitle11": "I had the pleasure of having Hudson on my team. A focused and creative developer, always seeking solutions to the challenges we encounter in the project. Proactive and available to help teammates, aiming for the best in delivering objectives!",
    "subtitle12": "A great professional and a deep connoisseur of the front-end, not limited to using frameworks to make the 'magic' happen. Highly recommended!",
    "subtitle13": "I had the pleasure of working with colleague Hudson Kennedy in the development team at Cast, on the MG-Florestas project, and I can attest to his exceptional skills and dedication. Hudson is a talented and passionate front-end developer, always demonstrating a deep understanding of the latest technologies and best practices. During our time together at Cast, he played a fundamental role in the success of the project. What impressed me most about Hudson is his ability to tackle complex challenges with creativity and efficiency. His attention to detail and commitment to delivering high-quality products always set him apart. In addition to his impressive technical skills, Hudson was an incredible team member. His clear communication and willingness to collaborate made the work environment more productive and enjoyable. I recommend Hudson without reservation and am confident that he will continue to have a positive impact wherever he goes. If you are looking for a talented and committed front-end developer, Hudson Kennedy is the right choice. Feel free to contact me if you need additional information. Sincerely, Gei Batista.",
    "subtitle14": "Hudson was one of the candidates I had the pleasure of meeting. A very educated person, with an incredible life story and led our conversation in a very relaxed manner, always explaining with great richness of detail his experiences. An excellent profile to be evaluated.",
    "subtitle15": "Hudson is a perfect professional, committed to what he does, always completing his projects with excellence.",
    "subtitle16": "Hudson is a super dedicated professional and committed to delivery, always demonstrating proactivity, ease, as well as initiative and the ability to solve problems objectively and with technical knowledge."
  },

  "experiences": {
    "title": " Le mie",
    "text": " Esperienze",
    "subtitle1": "Freelancer/Progetti Personali",
    "subtitle2": "Analista di E-commerce / Sviluppatore Front-end",
    "subtitle3": "Consulente Tecnico Fullstack",
    "subtitle4": "Ingegnere Frontend",
    "subtitle5": "Sviluppatore Fullstack",
    "subtitle6": "Sviluppatore Front-End Senior",
    "description1": "Ho seguito un corso di informatica industriale presso l'ETERJ e ho lavorato su progetti freelance, utilizzando Angular Js, VB.net, HTML, Javascript, Jquery, Bootstrap, Sass.",
    "description2": "Emissione di fatture, migrazione del sito da Wordpress a React con NodeJs, utilizzando redux, router proptypes, emailjs/browser, swiper, sweetalert, ecc... ottimizzazione e caricamento delle immagini e responsabile dell'integrazione dell'ERP Bling e dell'integrazione dei marketplace",
    "description3": "Consulenza Fullstack, utilizzando Java/NodeJs sul Backend, Angular/React sul Frontend, oltre a programmi Adobe Experience Manager(AEM), con servizi per Porto, CVC, ecc.",
    "description4": "Lavoro freelance, dove ho lavorato sulla creazione di architetture e sull'ottimizzazione di pagine e caricamento di immagini, utilizzando Vue3 sul Frontend, PHP e Laravel sul Backend, oltre a Docker e Webpack per configurare i container dell'applicazione, layout e stili con Sass/Scss, ecc...",
    "description5": "Agendo direttamente sulle direttive di manutenzione/refactoring del codice e trattamenti, utilizzando Java/springboot, NodeJs/Express sul Backend, PostgreSQL, Typescript con Angular/React sul Frontend",
    "description6": "Lavoro freelance, dove ho lavorato sull'architettura del progetto, aggiornando la versione di Angular 14 alla versione 15, aggiustamenti delle dipendenze, correzioni di sintassi, layout e stili con Sass/Scss, ecc...",
    "description7": "Lavoro freelance, Creazione e manutenzione di layout e interfacce con React, Styled-Components e Tailwind CSS, creazione di test unitari con Cypress e Jest, ottimizzazione di pagine e componenti.",
    "date1": "Febbraio 2012 - Ad oggi",
    "date2": "Febbraio 2019 - Giugno 2021",
    "date3": "Gennaio 2022 - Aprile 2022",
    "date4": "Aprile 2022 - Agosto 2022",
    "date5": "Agosto 2022 - Ottobre 2023",
    "date6": "Novembre 2023 - Gennaio 2024",
    "date7": "Aprile 2024 - Ad oggi"
  },

  "skills": {
    "title": "Le Mie",
    "text": " Competenze",
    "search": "Cerca...",
    "noResults" : "Nessuna competenza trovata",
    "cloudWord": "Nuvola di parole",
    "searchable": "Filtro e ricerca"
  },

  "projects": {
    "title": "Principali",
    "text": "Progetti",
    "subtitle": "Tecnologie Utilizzate",
    "data": [
      {
        "description": "Sito web semplice, seguendo le linee guida del corso orientato agli oggetti su Udemy"
      },
      {
        "description": "Pokedex utilizza l'API per interrogare ed elencare i Pokémon."
      },
      {
        "description": "Giochi creati in React e Typescript, per praticare ed esercitarsi un po' di più nel linguaggio."
      },
      {
        "description": "Un omaggio storico e una precisa ricreazione del gioco originale da sala giochi Pac-Man."
      },
      {
        "description": "App creata con HTML, CSS e JavaScript, consumando l'API del tempo, per visualizzare informazioni per ogni città."
      },
      {
        "description": "Orologio analogico e orologio digitale, realizzato con TypeScript e Styled-Components"
      },
      {
        "description": "Un modulo di carta di credito, costruito con vuejs e completamente responsivo. "
      },
      {
        "description": "Tracker delle festività del Canton svizzero"
      },
      {
        "description": "Schermata di accesso animata, fatta per esercitarsi"
      },
      {
        "description": "Convertitore di valuta globale, realizzato nel corso di Udemy"
      },
      {
        "description": "Una piccola web app per velocizzare il sorteggio delle squadre nel calcio"
      },
      {
         "description": "Sito web di un organizzatore di attività (elenco di cose da fare)"
      },
      {
         "description": "Semplice calcolatore BMI per il calcolo della massa corporea"
      },
      {
         "description": ""
      },
      {
         "description": ""
      },
      {
         "description": ""
      },
      {
         "description": ""
      }
    ]
  },

  "contact": {
    "title": "Contatto",
    "text": "Io !",
    "name": "Nome Completo *",
    "email": "Email *",
    "phone": "Telefono *",
    "subject": "Soggetto *",
    "message": "Il Tuo Messaggio *",
    "submit": "Invia Messaggio *",
    "error": "campo obbligatorio"
  }
}
