{
  "menu": {
    "home": "Home",
    "about": "About",
    "academic-education": "Academics",
    "testimonials": "Testimonials",
    "experiences": "Experiences",
    "skills": "Skills",
    "portfolio": "Projects",
    "contact": "Contact"
  },

  "home": {
    "title": "Better with each",
    "function": "Fullstack Developer",
    "resume": "Resume"
  },

  "about": {
    "title": " Who is ",
    "text": "- Hello, my name is Hudson Kennedy. As a passionate Web Developer and dedicated, I have accumulated solid experience over 10 years, complemented by interpersonal skills that I consider fundamental to the world of programming. I specialized in web technologies, having comprehensive knowledge that extends across several tools and languages. My passion for constant learning and my commitment to evolving continually push me to apply my vast experience in development of innovative and impactful web solutions. My communicative nature makes me always ready to play a vital role in innovative proposals. Let's build something amazing together!"
  },

  "education": {
    "title": " My",
    "text": " Academics"
  },

  "testimonials": {
    "title": "Some",
    "text": " Testimonials",
    "cards": [
      {
        "text": "Hudson is a super dedicated professional and committed to delivery, he has always demonstrated proactivity, resourcefulness, as well as initiative and the ability to solve problems objectively and with technical knowledge."
      },
      {
        "text": "Excellent work partner and a great person! His sense of responsibility stands out among the others, never leaving anything behind or unresolved. I learned a lot from Hudson and I will definitely take these lessons into life."
      },
      {
        "text": "Hudson is an excellent work partner, always looking to improve and develop new skills. He is always willing to help. Dedicated and committed."
      },
      {
        "text": "Exemplary professional! Very dedicated, diligent and proactive. And great interpersonal relationships. I highly recommend it!"
      },
      {
        "text": "Great Professional, always seeking to learn, improve and master new subjects. Assisting the team in resolving problems."
      },
      {
        "text": "Hudson for me was an excellent instructor. He taught me how to handle a platform, which is nowhere near my area. Exemplary and extremely capable professional. You have everything to take off in your Developer career."
      },
      {
        "text": "I worked with Hudson at Vilt. Even though it was a short period, I had the opportunity to meet this wonderful, lively and collaborative person. We participated in training and some challenges together, during this time he, as a more experienced person, proved to be a good advisor and a great motivator for everyone around him and especially for the more junior people. Always willing to help, he will be a great ally within any team."
      },
      {
        "text": "I had the opportunity to work with Hudson. It was a very interesting experience, as he is a very dedicated and competent professional when it comes to frontend. A pleasant surprise and I highly recommend it. Success Hudson!"
      },
      {
        "text": "Hudson is a complete professional, always proactive and willing to help, but in the time we worked together he really stood out for his skill in frontend development and knowledge of UX/UI, always very detailed. He has become a reference for me, I am sure he will contribute a lot to the team he will be part of!"
      },
      {
        "text": "Working with Hudson was an excellent experience. His understanding of FrontEnd is evident in each implementation and support of the team. He is proactive, creative and always seeks innovative and elegant solutions."
      },
      {
        "text": "I had the pleasure of having Hudson on my team. A focused and creative developer, always seeking to solve the challenges we encounter in the project. Proactive and available to help teammates, aiming for the best to achieve objectives!"
      },
      {
        "text": "A great professional and in-depth knowledge of Front-end, not limited to the use of frameworks for the 'magic' to happen. Highly recommended!"
      },
      {
        "text": "I had the pleasure of working with colleague Hudson Kennedy on the Cast development team on the MG-Florestas project and can attest to his exceptional skills and dedication. Hudson is a talented and passionate front-end developer, always demonstrating a deep understanding of the latest technologies and best practices. During our time together at Cast, he played a key role in the success of the project. What impressed me most about Hudson is his ability to face complex challenges with creativity and efficiency. His attention to detail and commitment to delivering high-quality products have always set him apart. In addition to his impressive technical skills, Hudson was an incredible member of the team. His clear communication and willingness to collaborate made the work environment more productive and pleasant. I recommend Hudson without reservation and am confident he will continue to have a positive impact wherever he goes. If you're looking for a talented and committed front-end developer, Hudson Kennedy is the right choice. Please feel free to get in touch if you require additional information. Sincerely, Gei Batista."
      },
      {
        "text": "Hudson was one of the candidates I had the pleasure of meeting. A very polite person, with an incredible life story and led our chat in a very relaxed way, always explaining his experiences in great detail. An excellent profile to be evaluated."
      },
      {
        "text": "Hudson is a perfect professional, committed to what he does, he always completes his projects with excellence"
      }
    ]
  },

  "experiences": {
    "title": " My",
    "text": " Experiences",
    "subtitle1": "Freelancer/Personal Projects",
    "subtitle2": "E-commerce Analyst / Front-end Developer",
    "subtitle3": "Fullstack Technical Consultant",
    "subtitle4": "Frontend Engineer",
    "subtitle5": "Fullstack Developer",
    "subtitle6": "Senior Front-End Developer",
    "description1": "I took an industrial computing course at ETERJ and worked on freelance projects, using Angular Js, VB.net, HTML, Javascript, Jquery, Bootstrap, Sass.",
    "description2": "Issuance of invoices, migration of the website from Wordpress to React with NodeJs, using redux, router proptypes, emailjs/browser, swiper, sweetalert, etc... optimization and loading of images and responsible for the integration of ERP Bling and integration of marketplaces",
    "description3": "Fullstack consultancy, using Java/NodeJs on the Backend, Angular/React on the Frontend, as well as Adobe Experience Manager(AEM) programs, with services for Porto, CVC, etc.",
    "description4": "Freelance work, where I worked on creating architecture and optimizing pages and image loading, using Vue3 on the Frontend, PHP and Laravel on the Backend, as well as Docker and Webpack to set up application containers, layouts and styles with Sass/Scss, etc...",
    "description5": "Acting directly on code maintenance/refactoring directives and treatments, using Java/springboot, NodeJs/Express on the Backend, PostgreSQL,Typescript with Angular/React on the Frontend",
    "description6": "Freelance work, where I worked on project architecture, updating Angular version 14 to version 15, dependency adjustments, syntax corrections, layouts and styles with Sass/Scss, etc...",
    "date1": "February 2012 - Present",
    "date2": "February 2019 - June 2021",
    "date3": "January 2022 - April 2022",
    "date4": "April 2022 - August 2022",
    "date5": "August 2022 - October 2023",
    "date6": "November 2023 - January 2024"
  },

  "skills": {
    "title": " My",
    "text": " Skills",
    "select1": "All Categories",
    "select2": "Databases",
    "select3": "Tools",
    "search": "Search..."
  },

  "projects": {
    "title": " Main",
    "text": " Projects",
    "subtitle": "Used Technologies",
    "data": [
      {
        "description": "Simple website, following object-oriented Course guidance on Udemy"
      },
      {
        "description": "Pokedex listing pokémons and their information, using lazy loading and filter."
      },
      {
        "description": "Game created in React, made with Typescript, to practice and exercise a little more in the language. Simple game, which will still have some updates and modifications as well."
      },
      {
        "description": "A historical homage and a precise recreation of the original Pac-Man arcade game."
      },
      {
        "description": "App created with HTML, CSS, and JavaScript, consuming the WeatherAPI, to display information for each city."
      },
      {
        "description": "Analog clock and digital clock, made with TypeScript and Styled-Components"
      },
      {
        "description": "A credit card form with smooth and pleasant microinteractions. Includes number formatting, validation, and automatic card type detection. Built with vuejs and fully responsive."
      },
      {
        "description": "Swiss Canton Holiday Tracker"
      },
      {
        "description": "Landing page, from pizzeria Pizza&Tutti, one of the best in Rio de Janeiro."
      },
      {
        "description": "Animated login screen, made for practice"
      },
      {
        "description": "Global Currency Converter, made in Udemy course"
      }
    ]
  },

  "contact": {
    "title": "Contact",
    "text": "Me!",
    "name": "Full Name",
    "email": "Email",
    "phone": "Phone",
    "subject": "Subject",
    "message": "Your Message",
    "submit": "Send Message",
    "name_error": "Name cannot be blank",
    "email_error": "Email cannot be blank",
    "phone_error": "Phone cannot be blank",
    "subject_error": "Subject cannot be blank",
    "message_error": "Message cannot be blank"
  }
}
